<?php require_once(__DIR__ . '/header.php'); ?>

	<div class="ui center aligned wow fadeIn" id="steps_bg_section">
        <img src="./assets/media/img/bg_steps.webp" class="ui image m-auto">
	</div>


	<div class="ui container fluid section wow fadeIn" id="steps_blocks">
		<div class="ui section-title" style="font-size: 20px;">
			<div class="ui huge header center aligned">Этапы разработки проекта</div>
		</div>

		<div class="ui container advantages">
			<div class="advantage wow fadeIn">
				<div class="ui two middle aligned column stackable grid">
					<div class="three wide column text-center">
						<svg width="135" height="135" viewBox="0 0 135 135" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M65.6951 14.8195C64.5599 14.0336 63.0025 14.3168 62.2167 15.4521C61.4308 16.5873 61.714 18.1447 62.8493 18.9305L65.6951 14.8195ZM66.9045 29.2676L69.0603 30.5336L66.9045 29.2676ZM66.9045 44.4121V46.9121C67.9154 46.9121 68.8267 46.3034 69.2139 45.3696C69.6011 44.4359 69.3878 43.3609 68.6736 42.6456L66.9045 44.4121ZM34.9306 49.9391L36.2526 52.0609L34.9306 49.9391ZM93.5503 52.7026L96.0503 52.7026C96.0503 51.7944 95.5578 50.9577 94.7638 50.5168C93.9698 50.076 92.9992 50.1005 92.2283 50.5807L93.5503 52.7026ZM93.5501 72.1451L91.0501 72.1451C91.0501 72.8081 91.3135 73.444 91.7823 73.9128C92.2512 74.3817 92.8871 74.6451 93.5501 74.6451V72.1451ZM106.873 83.1991L109.373 83.1635L106.873 83.1991ZM93.5501 97.0166L93.1238 94.5533C91.9254 94.7607 91.0501 95.8004 91.0501 97.0167L93.5501 97.0166ZM93.5503 110.834L95.0852 112.807C95.6941 112.334 96.0503 111.606 96.0503 110.834L93.5503 110.834ZM33.75 110.834H31.25C31.25 111.655 31.653 112.424 32.3282 112.89L33.75 110.834ZM36.25 67.5C36.25 66.1193 35.1307 65 33.75 65C32.3693 65 31.25 66.1193 31.25 67.5H36.25ZM62.8493 18.9305C64.1392 19.8235 65.2913 20.3838 65.9688 21.6037C66.446 22.4631 66.9459 24.2602 64.7488 28.0016L69.0603 30.5336C71.8263 25.8235 71.9498 22.0749 70.34 19.1762C68.9303 16.6379 66.2847 15.2276 65.6951 14.8195L62.8493 18.9305ZM64.7488 28.0016C63.4031 30.293 61.9108 33.2 61.5478 36.3452C61.1645 39.666 62.0589 43.0974 65.1355 46.1785L68.6736 42.6456C66.7206 40.6897 66.2988 38.7901 66.5148 36.9185C66.7511 34.8713 67.7736 32.7246 69.0603 30.5336L64.7488 28.0016ZM66.9045 41.9121C63.6911 41.9121 57.4693 42.1267 51.0725 42.939C44.8081 43.7345 37.8792 45.1565 33.6086 47.8172L36.2526 52.0609C39.5 50.0377 45.4256 48.6962 51.7024 47.8992C57.8469 47.1189 63.853 46.9121 66.9045 46.9121V41.9121ZM33.6086 47.8172C32.8141 48.3121 31.9425 49.0485 31.5091 50.1437C31.0133 51.3966 31.2797 52.6151 31.8604 53.5442C32.3811 54.3771 33.1545 55.0029 33.8878 55.4745C34.6523 55.9661 35.5593 56.4073 36.5461 56.8057C40.4447 58.3801 46.5672 59.6721 53.4057 60.3938C60.2861 61.12 68.0857 61.2893 75.4015 60.5205C82.6649 59.7573 89.704 58.0444 94.8723 54.8244L92.2283 50.5807C87.999 53.2157 81.8372 54.8167 74.8789 55.5479C67.9731 56.2736 60.5304 56.118 53.9305 55.4214C47.2888 54.7204 41.6931 53.4919 38.4183 52.1695C37.6118 51.8438 37.0095 51.5373 36.5922 51.2689C36.1437 50.9806 36.0629 50.8342 36.1003 50.894C36.1978 51.0499 36.3519 51.4944 36.1583 51.9835C36.0272 52.315 35.8723 52.2978 36.2526 52.0609L33.6086 47.8172ZM91.0503 52.7025L91.0501 72.1451L96.0501 72.1451L96.0503 52.7026L91.0503 52.7025ZM93.5501 74.6451C95.6327 74.6451 98.4343 75.5248 100.707 77.1716C102.966 78.8078 104.34 80.9167 104.373 83.2347L109.373 83.1635C109.31 78.7482 106.688 75.3301 103.641 73.1226C100.609 70.9258 96.7969 69.6451 93.5501 69.6451V74.6451ZM104.373 83.2347C104.439 87.8448 102.511 90.3807 100.257 91.9421C97.851 93.6084 94.944 94.2383 93.1238 94.5533L93.9764 99.48C95.9153 99.1445 99.7483 98.3766 103.104 96.0523C106.611 93.6231 109.464 89.5755 109.373 83.1635L104.373 83.2347ZM91.0501 97.0167L91.0503 110.834L96.0503 110.834L96.0501 97.0166L91.0501 97.0167ZM92.0153 108.861C89.735 110.635 86.0374 112.253 81.3341 113.465C76.6764 114.666 71.2194 115.422 65.5743 115.589C54.1755 115.928 42.5252 113.862 35.1718 108.778L32.3282 112.89C40.9622 118.86 53.8829 120.939 65.7228 120.587C71.697 120.41 77.5263 119.611 82.5824 118.307C87.5929 117.015 92.0364 115.179 95.0852 112.807L92.0153 108.861ZM36.25 110.834V67.5H31.25V110.834H36.25Z" fill="#C0A88C"/>
						</svg>
					</div>
					<div class="twelve wide right floated column">
						<div class="ui large header">Идея проекта</div>
						<span class="advantage_desc">
					   		Наша команда совместно с заказчиком прорабатывает идею проекта на основании его желаний и требований. На этом этапе выявляются пожелания клиента к типу проекта, его структуре и дизайну, вносятся коррективы в общую концепцию.
						</span>
					</div>
				</div>
			</div>

			<div class="advantage wow fadeIn">
				<div class="ui two middle aligned column stackable grid">
					<div class="three wide column text-center">
						<svg width="135" height="135" viewBox="0 0 135 135" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M45 59.0625C45 38.8696 61.3696 22.5 81.5625 22.5C101.755 22.5 118.125 38.8696 118.125 59.0625C118.125 79.2554 101.755 95.625 81.5625 95.625C71.7385 95.625 62.8194 91.7505 56.25 85.4462L16.875 112.5" stroke="#C0A88C" stroke-width="6" stroke-linecap="round" stroke-linejoin="round"/>
						</svg>
					</div>
					<div class="twelve wide right floated column">
						<div class="ui large header">Аналитика</div>
						<span class="advantage_desc">
					      	На этом этапе заказчик и наша команда определяют цели, которые предстоит достичь в ходе разработки, фиксируют бизнес-задачи, пользовательские требования и прочее. Этот процесс происходит в формате диалога, здесь важно участие обеих сторон.  Задача аналитика заключается в том, чтобы предусмотреть все возможные риски и предложить варианты оптимизации процесса разработки. Чем больше деталей озвучит заказчик, тем точнее будет составлено техническое задание и, соответственно, тем качественнее будет финальный результат.
						</span>
					</div>
				</div>
			</div>

			<div class="advantage wow fadeIn">
				<div class="ui two middle aligned column stackable grid">
					<div class="three wide column text-center">
						<svg width="135" height="135" viewBox="0 0 135 135" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M67.5 118.125C39.5406 118.125 16.875 95.4594 16.875 67.5C16.875 39.5406 39.5406 16.875 67.5 16.875C95.4594 16.875 118.125 39.5406 118.125 67.5C118.125 85.0523 109.192 100.518 95.625 109.6L67.5 73.125V39.375" stroke="#C0A88C" stroke-width="5" stroke-linecap="round" stroke-linejoin="round"/>
						</svg>
					</div>
					<div class="twelve wide right floated column">
						<div class="ui large header">Оценка проекта</div>
						<span class="advantage_desc">
				      	   	Собранные данные анализируются, и на их основе создается модель продукта, которая одинаково понятна как заказчику, так и разработчику. Далее рассчитываются предварительные временные и производительные затраты, необходимые для создания продукта. Оптимальный вариант – презентация, в которой подробно описана оценка проекта, возможные риски, команда для работы над проектом, различные варианты реализации задач, условия, этапность и другие детали.
						</span>
					</div>
				</div>
			</div>

			<div class="advantage wow fadeIn">
				<div class="ui two middle aligned column stackable grid">
					<div class="three wide column text-center">
						<svg width="135" height="135" viewBox="0 0 135 135" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M25.3125 78.75L39.1981 17.6534C39.3016 17.1981 39.7063 16.875 40.1732 16.875L94.8228 16.875C95.2915 16.875 95.6973 17.2005 95.799 17.6581L117.584 115.691C117.862 116.94 116.911 118.125 115.632 118.125L19.4366 118.125C18.1354 118.125 17.1807 116.902 17.4963 115.64L22.3106 96.3825C22.4219 95.9373 22.8219 95.625 23.2808 95.625L92.8125 95.625" stroke="#C0A88C" stroke-width="5" stroke-linecap="round" stroke-linejoin="round"/>
						</svg>
					</div>
					<div class="twelve wide right floated column">
						<div class="ui large header">Проектирование</div>
						<span class="advantage_desc">
		      	   	   		Когда все вопросы по предварительной оценке улажены, наступает этап проектирования, включающий:
		      	   	   		<ul>
		      	   	   			<li>Разработка карты проекта с указанием опорных точек для сверки результатов</li>
		      	   	   			<li>Проектирование архитектуры</li>
		      	   	   			<li>Выбор технологического стека – инструментов разработки, которые включают языки программирования, фреймворки, системы управления базами данных, компиляторы и т. д.</li>
		      	   	   		</ul>
						</span>
					</div>
				</div>
			</div>


			<div class="advantage wow fadeIn">
				<div class="ui two middle aligned column stackable grid">
					<div class="three wide column text-center">
						<svg width="135" height="135" viewBox="0 0 135 135" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path fill-rule="evenodd" clip-rule="evenodd" d="M83.904 19.7251C87.0925 15.9568 92.8208 15.7185 96.3112 19.209L105.204 28.1015C108.307 31.2045 108.513 36.1679 105.679 39.5178L47.1468 108.692C46.9008 108.983 46.5982 109.22 46.2576 109.391L34.4137 115.313H112.5C114.053 115.313 115.312 116.572 115.312 118.125C115.312 119.678 114.053 120.938 112.5 120.938H22.4998C21.1954 120.938 20.0622 120.041 19.7625 118.771C19.4628 117.502 20.0753 116.193 21.242 115.609L43.2256 104.618L101.385 35.8844C102.329 34.7678 102.261 33.1133 101.226 32.079L92.3338 23.1865C91.1703 22.023 89.2608 22.1024 88.198 23.3585L30.6217 91.4033L25.168 107.764C24.6768 109.238 23.084 110.034 21.6104 109.543C20.1368 109.052 19.3404 107.459 19.8316 105.986L25.4566 89.1106C25.5698 88.7712 25.7466 88.4565 25.9778 88.1833L83.904 19.7251Z" fill="#C0A88C"/>
						</svg>
					</div>
					<div class="twelve wide right floated column">
						<div class="ui large header">Дизайн</div>
						<span class="advantage_desc">
	      	   	   		  	После того как завершена аналитика, проект оценен и согласован, разработчики могут переходить к дизайну. Этот этап включает два блока:
	      	   	   		  	<ul>
	      	   	   		  		<li>Разработку UX – дизайн пользовательского интерфейса. UX отвечает за логику построения элементов системы, адаптивность и юзабилити продукта. </li>
	      	   	   		  		<li>Разработку UI – отрисовку элементов интерфейса: блоки, кнопки, иконки, которые собираются в готовый макет.</li>
	      	   	   		  	</ul>
	      	   	   		  	Многие ошибочно полагают, что дизайн – это только о визуальной части. На самом деле дизайн отвечает за формирование пользовательского опыта. 
						</span>
					</div>
				</div>
			</div>


			<div class="advantage wow fadeIn">
				<div class="ui two middle aligned column stackable grid">
					<div class="three wide column text-center">
						<svg width="135" height="135" viewBox="0 0 135 135" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M29.7661 75.5357V38.9732C29.7661 36.0885 32.1795 33.75 35.1566 33.75H99.8434C102.82 33.75 105.234 36.0885 105.234 38.9732V88.248C105.234 90.0827 106.227 91.7829 107.851 92.7269L115.499 97.1729C120.187 99.8985 118.192 106.875 112.725 106.875H22.2749C16.8077 106.875 14.8134 99.8985 19.5015 97.1729L28.4857 91.9497C29.3235 91.4626 30.2822 91.2054 31.2592 91.2054H89.0622" stroke="#C0A88C" stroke-width="5" stroke-linecap="round" stroke-linejoin="round"/>
						</svg>
					</div>
					<div class="twelve wide right floated column">
						<div class="ui large header">Разработка</div>
						<span class="advantage_desc">
      	   	   		  	   	Этот этап подразумевает реализацию идей заказчика уже оформленных в практические шаги. Идеальный формат – разработка спринтами. Команда Visce в соответствии с картой проекта проводит работу и показывает заказчику результат каждой части. Разработка в формате спринтов удобна и эффективна, т.к. позволяет максимально быстро собирать обратную связь, реагировать на изменения и вносить правки. Такой подход строится на основе гибкой методологии и называется итеративным. 
						</span>
					</div>
				</div>
			</div>


			<div class="advantage wow fadeIn">
				<div class="ui two middle aligned column stackable grid">
					<div class="three wide column text-center">
						<svg width="135" height="135" viewBox="0 0 135 135" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M47.3405 101.583L26.6334 111.771C20.7076 114.686 14.5233 108.297 17.7714 102.615L61.6432 25.8705C64.2122 21.3765 70.7878 21.3765 73.3568 25.8705L117.229 102.615C120.477 108.297 114.292 114.686 108.367 111.77L87.6595 101.583" stroke="#C0A88C" stroke-width="5" stroke-linecap="round" stroke-linejoin="round"/>
						</svg>
					</div>
					<div class="twelve wide right floated column">
						<div class="ui large header">Тестирование</div>
						<span class="advantage_desc">
  	   	   		  	   	   	Тестирование программного продукта – один из важнейших этапов в процессе его разработки, ведь до презентации нового продукта потребителям компания должна быть полностью уверена в его работоспособности. Поэтому так важно вовремя выявить критические баги, проверить функционал продукта, провести полноценный анализ и реализовать рекомендации по улучшению. 
							Для этого QA-инженеры могут использовать различные способы и методы тестирования нового IT-продукта: модульные, интеграционные, функциональные, приемочные. 
						</span>
					</div>
				</div>
			</div>


			<div class="advantage wow fadeIn">
				<div class="ui two middle aligned column stackable grid">
					<div class="three wide column text-center">
						<svg width="135" height="135" viewBox="0 0 135 135" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M68.3548 73.125C101.389 73.125 112.05 99.2103 117.309 115.542C117.722 116.825 116.756 118.125 115.408 118.125H37.9397M68.3548 73.125C60.0598 73.125 40.7047 67.5 40.7047 45C40.7047 28.125 51.7648 16.875 68.3548 16.875C84.9449 16.875 96.0049 28.125 96.0049 45C96.0049 56.25 88.2629 73.125 68.3548 73.125ZM68.3548 73.125C40.7396 73.125 28.7595 91.3538 22.5 106.875" stroke="#C0A88C" stroke-width="5" stroke-linecap="round" stroke-linejoin="round"/>
						</svg>
					</div>
					<div class="twelve wide right floated column">
						<div class="ui large header">Запуск</div>
						<span class="advantage_desc">
   	   		  	   	   	   	После того, как тестирование проведено и баги устранены, предстоит запуск готового продукта. Если раньше продукт был доступен только узкому кругу разработчиков и специалистов по контролю качества, то теперь предстоит встреча с реальными пользователями. На этом этапе также настраиваются инструменты мониторинга, помогающие изучить поведение пользователей и доработать продукт, если потребуется.
						</span>
					</div>
				</div>
			</div>


			<div class="advantage wow fadeIn">
				<div class="ui two middle aligned column stackable grid">
					<div class="three wide column text-center">
						<svg width="135" height="135" viewBox="0 0 135 135" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M16.875 45L16.875 99.25C16.875 100.355 17.7704 101.25 18.875 101.25L116.125 101.25C117.23 101.25 118.125 100.355 118.125 99.25L118.125 47C118.125 45.8954 117.23 45 116.125 45L106.875 45L67.9142 45C67.649 45 67.3946 44.8947 67.2071 44.7071L56.5429 34.0429C56.3554 33.8554 56.101 33.75 55.8358 33.75L28.125 33.75" stroke="#C0A88C" stroke-width="5" stroke-linecap="round" stroke-linejoin="round"/>
						</svg>
					</div>
					<div class="twelve wide right floated column">
						<div class="ui large header">Передача прав</div>
						<span class="advantage_desc">
   		  	   	   	   	   	Запуск произведен – разработчики выполнили свою часть работы и передают готовый продукт владельцу. На этом этапе контроль над программной частью и документацией полностью переходит заказчику. Детальные условия передачи прав прописываются в договоре о сотрудничестве между заказчиком и компанией-разработчиком.
						</span>
					</div>
				</div>
			</div>


			<div class="advantage wow fadeIn">
				<div class="ui two middle aligned column stackable grid">
					<div class="three wide column text-center">
						<svg width="135" height="135" viewBox="0 0 135 135" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M27.3933 33.75C36.9152 32.8125 58.2442 28.125 67.3852 16.875C72.1462 22.5 86.8099 33.75 107.377 33.75C115.947 54.375 119.946 100.125 67.3852 118.125C48.8508 112.319 17.4956 91.2472 23.1784 50.625" stroke="#C0A88C" stroke-width="5" stroke-linecap="round" stroke-linejoin="round"/>
						</svg>
					</div>
					<div class="twelve wide right floated column">
						<div class="ui large header">Техническая поддержка</div>
						<span class="advantage_desc">
		  	   	   	   	   	После завершения работ продукт нуждается в дальнейшей техподдержке. На этом этапе разработчик предлагает временное или постоянное сопровождение, чтобы после запуска новой системы снизить риски сбоев и обеспечить быстрое восстановление в случае неполадок. Временное обслуживание предполагает устранение возможных недочетов в течение ограниченного периода. Постоянная техподдержка удобна, если необходимо регулярно получать последние обновления ПО. В этом случае возможные сбои должны ликвидироваться быстро и незаметно для пользователей.
						</span>
					</div>
				</div>
			</div>


			<div class="advantage wow fadeIn">
				<div class="ui two middle aligned column stackable grid">
					<div class="three wide column text-center">
						<svg width="135" height="135" viewBox="0 0 135 135" fill="none" xmlns="http://www.w3.org/2000/svg">
							<path d="M16.875 106.301C23.9185 99.3214 39.1304 94.2666 45 92.8125C45 105.027 48.4239 113.036 50.625 118.125C57.6685 88.4617 71.9022 72.1301 78.5054 64.8597L80.7065 82.3087L96.1141 64.8597L118.125 69.2219L109.321 49.5918L118.125 29.9617H96.1141L80.7065 16.875L73.125 39.375L54.2935 47.4107L71.9022 56.25C63.0978 59.8852 41.1603 70.8061 25.3125 90" stroke="#C0A88C" stroke-width="5" stroke-linecap="round" stroke-linejoin="round"/>
						</svg>
					</div>
					<div class="twelve wide right floated column">
						<div class="ui large header">Заключение</div>
						<span class="advantage_desc">
	  	   	   	   	   	  	Работа с командой разработчиков должна быть удобной и эффективной, поэтому к выбору IT-партнера нужно подходить со всей ответственностью. Еще на этапе пресейла можно определить, насколько разработчик вам подходит, как он заботится клиенте, насколько специалисты его команды  компетентны и как быстро команда реагирует  на ваши пожелания. 
						</span>
					</div>
				</div>
			</div>

		</div>
	</div>


	<section class="stack wow fadeIn">
		<div class="container text-uppercase">
			<div class="fs-1 text-center wow fadeIn">Наш технологический стек</div>

			<div class="stackWrapper text-center wow fadeIn">
				<div class="fs-1 text-uppercase p-4">FRONTEND/BACKEND</div>
					<img src="./assets/media/img/steps/frontback.webp" alt="">
			</div>

			<div class="stackWrapper text-center wow fadeIn">
				<div class="fs-1 text-uppercase p-4">Mobile</div>
					<img src="./assets/media/img/steps/mobile.webp" alt="">
			</div>

			<div class="stackWrapper text-center wow fadeIn">
				<div class="fs-1 text-uppercase p-4">DESKTOP</div>
					<img src="./assets/media/img/steps/desktop.webp" alt="">
			</div>

			<div class="stackWrapper text-center wow fadeIns">
				<div class="fs-1 text-uppercase p-4">OS, Servers & Virtualization</div>
					<img src="./assets/media/img/steps/os.webp" alt="">
			</div>

		</div>
	</section>


<?php require_once(__DIR__ . '/footer.php'); ?>